/*【例8-2】指针取地址运算和间接访问运算示例。*/

/*  取地址运算和使用指针访问变量 */





#include <stdio.h>
int main (void)
{   
    // 用变量名称表示的变量 和用指针指向该变量名的变量 根本就是同一个变量。
    int a = 3, *p;            	/* 第4行：定义整型变量a和整型指针p */

    p = &a;                 	/* 把变量a的地址赋给指针p，即p指向a;  a的指针 就是a的地址 概念清楚*/
    printf ("a=%d, *p=%d\n", a, *p);	/* 输出变量a的值和指针p所指向变量的值*/
    *p = 10;                 	/* 对指针p所指向的变量赋值，相当于对变量a赋值 */
    printf("a=%d, *p=%d\n", a, *p);
    printf("Enter a: ");
    scanf("%d", &a);        	/* 输入a   这里的方法 为什么是存入&a 而不是 a */
    printf("a=%d, *p=%d\n", a, *p);
    (*p)++;					/* 指针指向的变量加1  */
    printf("a=%d, *p=%d\n", a, *p);

    return 0;
}
